omerfarukcetinkaya/yyy/S3-CAM-Hub/sdkconfig.defaults
# sdkconfig.defaults — ESP32-S3 N16R8 / s3_vision_hub
# Applied automatically by idf.py if no sdkconfig exists.
# Settings here override ESP-IDF defaults for this target.

# ── Target ────────────────────────────────────────────────────────────────────
CONFIG_IDF_TARGET="esp32s3"

# ── CPU ───────────────────────────────────────────────────────────────────────
CONFIG_ESP_DEFAULT_CPU_FREQ_MHZ_240=y
CONFIG_FREERTOS_HZ=1000

# ── PSRAM (Octal, 8 MB, 80 MHz) ───────────────────────────────────────────────
CONFIG_SPIRAM=y
CONFIG_SPIRAM_MODE_OCT=y
CONFIG_SPIRAM_SPEED_80M=y
CONFIG_SPIRAM_USE_MALLOC=y
CONFIG_SPIRAM_MALLOC_ALWAYSINTERNAL=8192
CONFIG_SPIRAM_IGNORE_NOTFOUND=n
CONFIG_SPIRAM_TRY_ALLOCATE_WIFI_LWIP=y

# ── Flash ─────────────────────────────────────────────────────────────────────
CONFIG_ESPTOOLPY_FLASHSIZE_16MB=y
CONFIG_PARTITION_TABLE_CUSTOM=y
CONFIG_PARTITION_TABLE_CUSTOM_FILENAME="partitions.csv"

# ── FreeRTOS ──────────────────────────────────────────────────────────────────
CONFIG_FREERTOS_UNICORE=n
CONFIG_ESP_MAIN_TASK_STACK_SIZE=8192
CONFIG_FREERTOS_GENERATE_RUN_TIME_STATS=y
CONFIG_FREERTOS_USE_TRACE_FACILITY=y
# Use esp_timer (1 MHz, µs) for runtime stats.
# CPU_CLK mode returns total_runtime=0 in ESP-IDF v5 SMP — unusable for delta%.
CONFIG_FREERTOS_RUN_TIME_STATS_USING_ESP_TIMER=y

# ── Wi-Fi ─────────────────────────────────────────────────────────────────────
CONFIG_ESP_WIFI_STATIC_RX_BUFFER_NUM=10
CONFIG_ESP_WIFI_DYNAMIC_RX_BUFFER_NUM=32
CONFIG_ESP_WIFI_AMPDU_RX_ENABLED=y
CONFIG_ESP_WIFI_AMPDU_TX_ENABLED=y

# ── Networking ────────────────────────────────────────────────────────────────
# max_open_sockets (13) + 1 listening socket = 14 needed.
# Default LWIP_MAX_SOCKETS=10 → httpd_start() silently fails. Set to 16.
CONFIG_LWIP_MAX_SOCKETS=16
# 64 KB send buffer: one full JPEG frame (~30-70 KB) fits in a single kernel
# call. With the default 5760 bytes, httpd_resp_sendstr() blocks mid-response
# while iOS slowly ACKs — the httpd task freezes, starving all other requests.
# 65535 is the maximum allowed by the Kconfig range (2440-65535 without
# WND_SCALE). 131072 exceeds that range and is silently rejected → stays 5760.
# NOTE: TCP_SNDLOWAT = SND_BUF/2 must fit in u16_t (< 59775); 65535/2=32767 ✓
CONFIG_LWIP_TCP_SND_BUF_DEFAULT=65535
CONFIG_LWIP_TCP_WND_DEFAULT=65535
CONFIG_LWIP_TCP_RECVMBOX_SIZE=12
CONFIG_LWIP_UDP_RECVMBOX_SIZE=6
CONFIG_LWIP_TCPIP_RECVMBOX_SIZE=32
CONFIG_LWIP_TCPIP_TASK_STACK_SIZE=4096

# ── HTTP Server ───────────────────────────────────────────────────────────────
CONFIG_HTTPD_MAX_REQ_HDR_LEN=1024
CONFIG_HTTPD_MAX_URI_LEN=512
CONFIG_HTTPD_ERR_RESP_NO_DELAY=y
# WebSocket support for /ws/stream push-based video broadcaster.
CONFIG_HTTPD_WS_SUPPORT=y

# ── Logging ───────────────────────────────────────────────────────────────────
CONFIG_LOG_DEFAULT_LEVEL_INFO=y
CONFIG_LOG_MAXIMUM_LEVEL_DEBUG=y

# ── Watchdog ──────────────────────────────────────────────────────────────────
CONFIG_ESP_TASK_WDT_EN=y
CONFIG_ESP_TASK_WDT_INIT=y
CONFIG_ESP_TASK_WDT_TIMEOUT_S=10
CONFIG_ESP_TASK_WDT_PANIC=y

# ── NVS ───────────────────────────────────────────────────────────────────────
CONFIG_NVS_ASSERT_ERROR_CHECK=n

# ── Wi-Fi credentials ─────────────────────────────────────────────────────────
CONFIG_VH_WIFI_SSID="localhost-ofc-dev0"
CONFIG_VH_WIFI_PASSWORD="1994Far.?!1994Far.?!"

# ── Camera ────────────────────────────────────────────────────────────────────
# framesize_t enum (espressif__esp32-camera sensor.h):
#   7  = FRAMESIZE_320X320  (320×320)
#   10 = FRAMESIZE_VGA      (640×480)  ← target
#   11 = FRAMESIZE_SVGA     (800×600)
# HD (FRAMESIZE_HD=13, 1280×720) needs >180KB DMA and ~10Mbps — not feasible.
CONFIG_VH_CAM_FRAME_SIZE=10
CONFIG_OV3660_SUPPORT=y
# Pin camera DMA task to Core 1 (same as stream_task, motion_detect).
# Core 0 must remain free for WiFi/LWIP/httpd — they share bus with camera GDMA.
CONFIG_CAMERA_CORE1=y
# VGA (640×480) quality=35 for snapshot polling.
# At PCLK=10 MHz hardware produces ~25 fps. JPEG ~40-70 KB/frame at quality=35.
# 10fps × 55KB = 550KB/s = 4.4 Mbps — within ESP32-S3 Wi-Fi TCP throughput.
CONFIG_VH_CAM_JPEG_QUALITY=35
# 3 frame buffers for CAMERA_GRAB_WHEN_EMPTY.
# With 3 buffers: DMA fills 2 while app holds 1 → fb_get() returns immediately.
# 3 × 160KB = 480KB PSRAM for camera buffers.
CONFIG_VH_CAM_FB_COUNT=3

# ── Camera JPEG DMA buffer ─────────────────────────────────────────────────────
# VGA quality=35 JPEG = 40-70 KB typical, 100 KB worst-case.
# 160 KB gives comfortable headroom. 3 × 160 KB = 480 KB PSRAM total.
CONFIG_CAMERA_JPEG_MODE_FRAME_SIZE_CUSTOM=y
CONFIG_CAMERA_JPEG_MODE_FRAME_SIZE=163840

# ── SPI (W25Q64 external flash) ───────────────────────────────────────────────
CONFIG_SPI_MASTER_IN_IRAM=y
